stew/stew.tex
% Created 2018-03-22 Thu 08:45
\documentclass[letterpaper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{mycv}
\hypersetup{hidelinks}
\usepackage{enumitem}
\setlist{nolistsep}
\pagenumbering{gobble}
\author{Stew O'Connor}
\date{\today}
\title{Mike (stew) O'Connor}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.2.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\resheader{ 408.466.5060 }{  }{ stew.vireo.org }{ mikeyo@gmail.com }{  }{ github.com/stew }

\section{Summary}
\label{sec-1}

I'm dedicated to the art and craft of software engineering. I've had a
varied range of experiences around developing software and I'm always
looking for new ones. In my third decade of working with computers,
I've been lucky to work on a huge variety projects. I've written C++
for banks, I've written Perl scripts for record companies, I've run
email servers for an African government. I've taken apart laser
printers, I've run miles of cat-5. Now I'm interested in finding my
next project. I need to be working with people I can learn from and
people that can learn from me.

\section{Work Experience}
\label{sec-2}
\subsection{Sr. Principal Engineer -- Lendup}
\label{sec-2-1}
\subsubsection{July 2017 - Now}
\label{sec-2-1-1}
\vspace{0.1in} 

Acted as the primary liaison between multiple engineering teams and
the product team and the legal compliance teams. Responsible for the
crafting of most technical specifications and their approval processes
with the wider technical forum, and legal compliance teams. Provided
both group instruction and one on one instruction on safer programming
techniques related to pure functional programming.
\vspace{0.1in}

Bootstrapped the Scala programming language usage in the company,
providing an infrastructure for Scala projects to set developers up
for easy success, providing project templates, a build system, and
deployment recipes to setup Scala developers for success. Facillitated
the first open-source contribution by LendUp: \url{https://github.com/lendup/fs2-blobstore}

\subsection{Distinguished Engineer / Services Architect -- Verizon}
\label{sec-2-2}
\subsubsection{September 2014 - June 2017}
\label{sec-2-2-1}
\emph{Verizon Labs / Verizon Fios / OnCue}\\
\vspace{0.1in}

One of two Services Architects responsible for the design and delivery
of a system of consisting of hundreds of software services written by
hundreds of developers collaborating to create a video streaming
platform to power all aspects of streaming video for Verizon,
including phones, set-top boxes and  web browsers.

\vspace{0.1in}

Was responsible for crafting the strategy for moving from EC2s to
cluster resource schedulers (mesos and nomad), moving from AWS to in
house datacenters, while reinventing our discovery and deployment
technology and modernizing our development stack for new technologies
such as containers.
\vspace{0.1in}

Initiated several security initiatives to identify areas where
developers had poor practices leading to large numbers of security
vulnerabilities. Started regular auditing to proactively catch these
problems. Was able to effect changes on teams all across Verizon.
 \vspace{0.1in}

Helped in getting the first projects open-sourced in Verizon's
history, some notable examples: 
\begin{itemize}
\item \url{https://github.com/getnelson/nelson}
\item \url{https://github.com/verizon/funnel}
\item \url{https://github.com/verizon/remotely}
\end{itemize}

\subsection{Senior Software Developer at Reverb Technologies}
\label{sec-2-3}
\subsubsection{February 2013 - September 2014}
\label{sec-2-3-1}
\emph{Reverb Technologies (now Inform)}\\
\vspace{0.1in}

Lead a team of developers responsible for all of the microservices
supporting a content discovery app for iPads / iPhones. Taught
developers Functional Programming. Was responsible for helping
architect solutions to scale the app to hundreds of thousands of
customers.

\subsection{Principal at Vireo, LLC}
\label{sec-2-4}
\subsubsection{November 2000 - January 2013}
\label{sec-2-4-1}
\vspace{0.1in}

With my partner, ran a successful consulting company that worked on a
diverse set of projects, Some Highlights:
\begin{itemize}
\item Helped design an implement a network of servers using Linux Virtual
Server to provide a high availability infrastructure for an credit
card processing system for Merchant e-Solutions.
\item Helped write a mail client in Java for komera.com.  The goal of the
project was to create a highly portable mail client that could be
used in poorly connected African communities.  Wrote custom server
software that enabled users of the mail application to perform
server side operations such as account creation and setting up
server side mail filtering rules.
\item Set up and maintained mail/web servers for the World Bank's projects
in Chad, and the President of Chad: \url{http://presidence-tchad.org}, \url{http://ccsrp-tchad.org},
\item Created a system for the creation and delivery of cell phone
ringtones which produced and delivered over 50,000 ringtones per day.
\item Responsible for the programming, administration of many high profile
fashion oriented e-commerce sites, some notable examples:
\url{http://jonathanadler.com} \url{http://verawang.com} \url{http://lanvin.com} \url{http://vmagazine.com}
\item Authored software used to streamline the collection of data for
filling out and electronically filing Medicaid / Medicare
applications with the NYC government. Automated the deployment of
servers to run the application in a HIPAA complaint datacenter.
\end{itemize}

\subsection{VP of Engineering at KIWI Consulting}
\label{sec-2-5}
\subsubsection{1999 - 2000}
\label{sec-2-5-1}
\vspace{0.1in}

KIWI Consulting was a consulting firm specializing in E-Commerce web
development using Java technologies to create highly scalable,
cross-platform applications.
\vspace{0.1in}

Co-designer and co-developer of an application framework for the
development of three-tiered Java applications with a backend providing
multiple database systems support including Oracle, SQLServer, and
Postgres, used to rapidly develop e-commerce web sites. This framework
became the basis for all subsequent development projects at KIWI.
\vspace{0.1in}

Project Manger in the development of an E-Commerce solution for Fila
Sportswear. Managed a team of developers. Was the primary client
interface. The site is being deployed using the development
framework described above.

\vspace{0.1in}
Was responsible for the design and development of an online Business
to Business dynamic negotiation system. The system supported real-time
auctions and reverse auctions, that could be single- or
multi-variable. The client software was written using Java applets,
and DHTML. It featured real-time updating and chatting capabilities
(pre-ajax). 
\vspace{0.1in}

Was responsible for all Makefile programming / configuration
management for KIWI. This was accomplished using gmake, bash shell
scripting, and Perl.

\vspace{0.1in}
Was solely responsible for the administration of all servers, running
Linux, Windows NT, Oracle, SQLServer, Apache, NFS, FTP. Was
responsible for all networking, including a T1, a WiFi network and
Ethernet network.

\subsection{Software Engineer at Merrill Lynch}
\label{sec-2-6}
\subsubsection{1997 To 1999}
\label{sec-2-6-1}
\vspace{0.1in}

Member of a team responsible for:
\begin{itemize}
\item Researching emerging software technologies in the area of distributed computing,
\item Developing application infrastructure,
\item providing consulting to other teams at Merrill Lynch,
\item Evaluating software developed by other teams at Merrill Lynch.
\end{itemize}

\vspace{0.1in}
Achievements include:
\begin{itemize}
\item Designed and implemented an administrative tool for the Microsoft Message Queuing System (MSMQ).
\item Designed and implemented software to manage components running under the Microsoft Transaction Server (MTS).
\item Created a reusable component library for creating Microsoft Management Console (MMC) SnapIns.
\item Wrote a reusable component library for MSMQ running under MTS.
\item Actively participated in beta programs for MSMQ 1.0, MTS 1.1, 2.0, Windows NT Enterprise Server, Windows NT Server 5.0, MMC, Microsoft Clustering (Wolfpack) 1.0.
\item Responsible for system administration of 8 NT Servers used for beta testing Microsoft pre-release products.
\end{itemize}

\subsection{Software Engineer at Logic Works,}
\label{sec-2-7}
\subsubsection{April 1996 to May 1997}
\label{sec-2-7-1}
\vspace{0.1in}

Added enhancements to a Business Process Re-engineering modeling tool,
BPwin, including an ODBC interface to a third-party simulation tool,
BPSimulator, and added support for IDEF3 workflow modeling. Was the
lead developer for a new release of BPwin. Converted the application's
16 bit code to be 16/32 bit compatible. Wrote software to convert the
application to a multi-user repository, ModelMart, shared with another
software product, the ERwin data-modeling tool

\subsection{Contractor at First Data Resources,}
\label{sec-2-8}
\subsubsection{November 1995 to March 1996}
\label{sec-2-8-1}
\vspace{0.1in}

Worked as a member of the Credit Application team for this large
credit card software provider. Personally wrote an OCX as a front-end
for viewing and updating the fraud databases. Ported 16 bit Windows
code to 32 bit for Windows 95/NT for a large credit card processing
application.

\subsection{Computer Programmer at Micro Logic Corp}
\label{sec-2-9}
\subsubsection{October 1994 to November 1995}
\label{sec-2-9-1}
\emph{\url{http://miclog.com}} /\\
\vspace{0.1in}

Worked on a team of four developers creating a commercially available
Personal Information Management software package called
InfoSelect. The environment was Windows 3.x, Windows 95, and Windows
NT, using Visual C++ 1.x and 2.x with Microsoft Foundation Classes ver
2.5 \& 3.0. Personal responsibilities included the design and coding of
the database engine, all import and export functionality, and in-house
programmer utilities. Wrote a version control and source code
integration utility. Converted the 16-bit code base to be portable
between the 16-bit and 32-bit Windows platforms. Wrote a MAPI
Messaging Service Provider and made the product MAPI enabled using OLE
interfaces. Also performed maintenance and enhancements to the
in-house Order Entry and Distribution system written in C++ using the
CodeBase class library.

\subsection{PC Support Technician at Rodale Press, INC}
\label{sec-2-10}
\subsubsection{1994}
\label{sec-2-10-1}
\emph{\url{http://rodaleinc.com}}\\
\vspace{0.1in}
Provided end-user/PC help desk support and technical troubleshooting
for 1,000 PC workstations on a Novell network. Performed hardware and
software installations and upgrades.
\subsection{Programmer, Network Administration at Plus Marketing}
\label{sec-2-11}

\section{Open-Source Experience}
\label{sec-3}
\subsection{Summary}
\label{sec-3-1}
Stew has been a contributor to open source projects for decades, many
projects can be found on github or
\url{https://sourceforge.net/u/stewatvireo}. I've highlighted some of the more
notable projects below.

\subsection{Typelevel}
\label{sec-3-2}
\subsubsection{2015 to Present}
\label{sec-3-2-1}
\emph{\url{http://typelevel.org}}\\

The Typelevel project aims to foster a welcoming and friendly group
that helps foster type driven functional programming in Scala. Stew
was one of the founders of the typlevel project. The most widely
known software from typelevel is "Cats", a library for functional
programming in Scala with roots in category theory. Stew is one of the
most prominent contributors to Cats, and has presented the library at
multiple Scala / FP Conferences

\begin{itemize}
\item \url{https://github.com/typelevel/cats/graphs/contributors}
\item \url{https://www.youtube.com/watch?v=AAMncMqpOds}
\end{itemize}


\subsection{Debian Developer / FTP Wizard}
\label{sec-3-3}
\subsubsection{2006 to Present}
\label{sec-3-3-1}
\emph{\url{http://debian.org}}\\
Maintained many packages for the Debian GNU/Linux distribution. Worked
on the "FTP" team which is responsible for running the Debian package
archive (which powers apt-get). Helped maintain the software running
the archive. Helped gate the new package queue to manually inspect new
software proposed to be included in Debian for licensing compatibility
and adherence to Debian policy.

\begin{itemize}
\item \url{https://www.debian.org/intro/organization} (search for O'Connor)
\item \url{https://lists.debian.org/debian-newmaint/2007/12/msg00039.html}
\item You can probably find me on any Debian / Ubuntu box:
find /usr/share/doc -type f | xargs zgrep -iE '(stew|mike).*(vireo|connor)'
\end{itemize}


\section{Education}
\label{sec-4}
\subsection{Carnegie Mellon University, Pittsburgh, PA}
\label{sec-4-1}
\subsection{School of Computer Science}
\label{sec-4-2}
\subsection{Sep 1990 - Dec 1993}
\label{sec-4-3}
% Emacs 25.2.2 (Org mode 8.2.10)
\end{document}
